//class template version 5.0 //07.07.2023//
#include <iostream>
#include <string>
#include <windows.h>
#include <time.h>
#include <algorithm>
#include <conio.h>
//My own headers
#include "Service functions.h"


// Class Work 28.08.2023 -------------------------------------------	

// Class Diagram

// Тяжелые связи (ведут к высокой связности):
/* 
	1) Использование
	2) Композиция
	3) Наследования
*/
	 
// Композиция, применение:
/*
	* хранение по значению (преимущественно)
	1) Применение классов сторонних библиотек
	2) Нет предпоссылок к изменению используемого класса/поля

	 
*/


// Агрегация, применение:
/*
	* является гибкой при использовании через полиморфизм
	** хранение по ссылочным типам


*/

